## Importing the required LIBRARY and Setting up Connection

##### Here I have created a Database named "dummy_zomato2" in which I am going to create the multiple tables for the required SQL Queries

In [175]:
import sqlite3
conn = sqlite3.connect('dummy_zomato2.db')
cursor = conn.cursor()
print("Opened database successfully")

Opened database successfully

##### Creating and populating the first table named "DELIVERY2" which contains the details of the  Delivery boys of Zomato
It has 6 columns :\
**ID** - Unique ID associated with each delivery boy\
**NAME** - Name of the Delivery Associates\
**AGE** - Age of the Delivery Associates\
**Location** - City where they deliver food from Zomato \
**AVG** - It is the average time they take to deliver an item to the Customer

In [176]:
cursor.execute('''CREATE TABLE DELIVERY2
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         LOCATION        CHAR(50),
         RATING REAL,
         AVG DELIVERY TIME REAL);''')
#cursor.close()

In [177]:
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (1, 'Rohan', 23, 'Bangalore', 4.3, 32.0)");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (2, 'Allen', 21, 'Bangalore', 4.0, 27.0 )");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (3, 'Martha', 28, 'Bangalore', 4.8, 25.3 )");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (4, 'Palak', 32, 'Bangalore', 3.9, 30.2)");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (5, 'Rahul', 20, 'Bangalore', 4.1, 27.4)");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (6, 'Drishant', 29, 'Bangalore', 3.8, 25.6 )");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (7, 'Mohan', 25, 'Bangalore', 4.0, 20.18 )");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (8, 'Vishal', 19, 'Bangalore', 4.3, 26.0)");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (9, 'Ravish', 23, 'Bangalore', 4.4, 25.0)");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (10, 'Kumar', 24, 'Bangalore', 4.0, 27.5 )");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (11, 'Shiva', 35, 'Bangalore', 3.6, 29.8 )");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (12, 'Kabir', 33, 'Bangalore', 3.9, 30.6)");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (13, 'Gourav', 23, 'Bangalore', 4.4, 28.4)");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (14, 'Drishant', 29, 'Bangalore', 3.8, 25.6 )");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (15, 'Vijay', 40, 'Bangalore', 4.7, 23.18 )");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (16, 'DK', 17, 'Bangalore', 4.5, 23.0)");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (17, 'Ravi', 37, 'Bangalore', 3.4, 37.6)");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (18, 'Gautam', 23, 'Bangalore', 4.0, 22.4)");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (19, 'Viom', 29, 'Bangalore', 3.2, 40.0 )");
cursor.execute("INSERT INTO DELIVERY2 (ID,NAME,AGE,LOCATION,RATING,AVG) \
      VALUES (20, 'Harry', 35, 'Bangalore', 4.6, 26.18 )");

conn.commit()
#conn.close()

##### Creating and populating the second table named "CUSTOMER1" which contains the details of the Customers of Zomato
It has 4 columns :\
**ID** - Unique ID associated with each customer & also the primary key of the table\
**NAME** - Name of the CUstomer\
**Location** - City where the customer lives in \
**NO_OF_ORDERS_PER_MONTH** - It is the total number of times the custoer orders food from zomato in a month

In [178]:
cursor.execute('''CREATE TABLE CUSTOMER1
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         LOCATION        CHAR(50),
         NO_OF_ORDERS_PER_MONTH INT);''')

In [179]:
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (21, 'Suamangal Saha','Bangalore',7)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (22, 'Vishal Roy','Bangalore',5)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (23, 'Kaushik Das','Bangalore',3)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (24, 'Girish Bhattacharjee','Bangalore',13)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (25, 'Sruti Bhattacharya','Bangalore',5)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (26, 'Sayantini Deb','Bangalore',15)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (27, 'DK Saha','Bangalore',25)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (28, 'Anannya Chakraborty','Bangalore',9)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (29, 'Arnab Roy','Bangalore',14)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (30, 'Srinjana Barman','Bangalore',2)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (31, 'Devasmita Nath','Bangalore',6)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (32, 'Hrituraj Majumder','Bangalore',20)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (33, 'Rahul Das','Bangalore',7)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (34, 'Rituparna Saha','Bangalore',3)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (35, 'Rajat Saha','Bangalore',26)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (36, 'Ishanka Das','Bangalore',4)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (37, 'Ankit Das','Bangalore',8)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (38, 'Apratim Deb','Bangalore',5)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (39, 'Nirmalya Debroy','Bangalore',6)");
cursor.execute("INSERT INTO CUSTOMER1 (ID,NAME,LOCATION,NO_OF_ORDERS_PER_MONTH) \
      VALUES (40, 'Adrija Acharya','Bangalore',3)");

conn.commit()

##### Creating and populating the third table named "RESTAURANTS1" which contains the details of the Restaurants covered by Zomato
It has 4 columns :\
**ID** - Unique ID associated with each RESTAURANT & also the primary key of the table\
**NAME** - Name of the Restaurant\
**Location** - City where the restaurant is in \
**RATING** - Aerage rating given by different zomato users to the restaurant

In [180]:
cursor.execute('''CREATE TABLE RESTAURANTS1
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         LOCATION        CHAR(50),
         RATING REAL);''')

In [181]:
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
       VALUES (105, 'RAJ PAILION', 'Bangalore', 4.5)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (106, 'ITC Gardenia', 'Bangalore', 4.6)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (107, 'The Creek', 'Bangalore', 4.2 )");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (108, 'ShakesBierre', 'Bangalore', 4.3)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (109, 'Tim Tai', 'Bangalore', 4.0)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (110, 'Kebabs & Kerries', 'Bangalore', 5.0 )");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (111, 'Time Traveller', 'Bangalore', 4.8)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (112, 'Tarmarind', 'Bangalore', 4.2)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (113, 'The Royal Afghan', 'Bangalore', 4.1)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (114, 'Tiamo', 'Bangalore',  4.7 )");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (115, 'Whitefield Bar aand Grill', 'Bangalore', 4.5)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (116, 'Cubbon Pavilion', 'Bangalore', 5.0)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (117, 'Alto Vino', 'Bangalore', 4.7 )");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (118, 'Yataii', 'Bangalore', 4.5)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (119, 'Hype', 'Bangalore', 4.3)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (120, 'Blue Wings', 'Bangalore', 3.9)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (121, 'Classic INN', 'Bangalore', 3.8)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (122, 'Matru Sagar Veg', 'Bangalore', 3.5)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (123, 'Wok Paper Scissors', 'Bangalore', 4.7)");
cursor.execute("INSERT INTO RESTAURANTS1 (ID,NAME,LOCATION,RATING)\
      VALUES (124, 'Farzi Cafe', 'Bangalore', 4.2)");

conn.commit()

So far I have created 3 tables , now I will  import the **pandas** library and convert these SQL tables into pandas dataframe and run SQL Queries on them later

In [182]:
import pandas as pd

#### Different Tables in the Database

In [183]:
for row in cursor.execute("SELECT name FROM sqlite_master WHERE type='table';"):
    print(row)

('DELIVERY2',)
('CUSTOMER1',)
('RESTAURANTS1',)

### Reading the tables into a Pandas Dataframe
##### For this  purpose I will  use the command "pd.read_sql_query"

In [199]:
Delivery_table = pd.read_sql_query("SELECT * FROM DELIVERY2", conn)
Customer_table = pd.read_sql_query("SELECT * FROM CUSTOMER1", conn)
Restaurant_table = pd.read_sql_query("SELECT * FROM RESTAURANTS1", conn)
Order_table = pd.read_sql_query("SELECT * FROM ORDERS4", conn)

### Table Containing details of the Zomato Delivery Assocites

In [185]:
Delivery_table.head()

   ID    NAME  AGE   LOCATION  RATING   AVG
0   1   Rohan   23  Bangalore     4.3  32.0
1   2   Allen   21  Bangalore     4.0  27.0
2   3  Martha   28  Bangalore     4.8  25.3
3   4   Palak   32  Bangalore     3.9  30.2
4   5   Rahul   20  Bangalore     4.1  27.4

### Table Containing details of the Zomato Users/Customers

In [186]:
Customer_table.head()

   ID                  NAME   LOCATION  NO_OF_ORDERS_PER_MONTH
0  21        Suamangal Saha  Bangalore                       7
1  22            Vishal Roy  Bangalore                       5
2  23           Kaushik Das  Bangalore                       3
3  24  Girish Bhattacharjee  Bangalore                      13
4  25    Sruti Bhattacharya  Bangalore                       5

###  Table Containing details of the Zomato Restaurants

In [187]:
Restaurant_table.head()

    ID          NAME   LOCATION  RATING
0  105   RAJ PAILION  Bangalore     4.5
1  106  ITC Gardenia  Bangalore     4.6
2  107     The Creek  Bangalore     4.2
3  108  ShakesBierre  Bangalore     4.3
4  109       Tim Tai  Bangalore     4.0

## SQL QUERIES FOR THE DIFFERENT QUESTIONS

#### QUESTION 1 - Write a SQL query to find the number of Zomato users

In [188]:
Zomato_users = pd.read_sql_query("SELECT COUNT(*) FROM CUSTOMER1", conn)
print(Zomato_users)

   COUNT(*)
0        20

#### QUESTION 2 - Write a SQL query to find details of Zomato delivery Boy

In [189]:
Delivery_boy_details = pd.read_sql_query("SELECT NAME, AGE, LOCATION, RATING FROM DELIVERY2",conn)
print(Delivery_boy_details)

        NAME  AGE   LOCATION  RATING
0      Rohan   23  Bangalore     4.3
1      Allen   21  Bangalore     4.0
2     Martha   28  Bangalore     4.8
3      Palak   32  Bangalore     3.9
4      Rahul   20  Bangalore     4.1
5   Drishant   29  Bangalore     3.8
6      Mohan   25  Bangalore     4.0
7     Vishal   19  Bangalore     4.3
8     Ravish   23  Bangalore     4.4
9      Kumar   24  Bangalore     4.0
10     Shiva   35  Bangalore     3.6
11     Kabir   33  Bangalore     3.9
12    Gourav   23  Bangalore     4.4
13  Drishant   29  Bangalore     3.8
14     Vijay   40  Bangalore     4.7
15        DK   17  Bangalore     4.5
16      Ravi   37  Bangalore     3.4
17    Gautam   23  Bangalore     4.0
18      Viom   29  Bangalore     3.2
19     Harry   35  Bangalore     4.6

#### QUESTION 3 - Write a SQL query to find  the list of Zomato users who made more than 10 orders in a particular month

In [190]:
Customer_order = pd.read_sql_query("SELECT NAME FROM CUSTOMER1 WHERE NO_OF_ORDERS_PER_MONTH > 10 ", conn)
print(Customer_order)

                   NAME
0  Girish Bhattacharjee
1         Sayantini Deb
2               DK Saha
3             Arnab Roy
4     Hrituraj Majumder
5            Rajat Saha

#### QUESTION 4 - Write a SQL query to find top 10 Zomato delivery Boy on basis of customer rating and time to deliver the item

In [191]:
Efficient_delivery_boys = pd.read_sql_query("SELECT NAME, RATING, AVG FROM DELIVERY2 ORDER BY RATING DESC, AVG DESC LIMIT 10", conn)
print(Efficient_delivery_boys)

     NAME  RATING    AVG
0  Martha     4.8  25.30
1   Vijay     4.7  23.18
2   Harry     4.6  26.18
3      DK     4.5  23.00
4  Gourav     4.4  28.40
5  Ravish     4.4  25.00
6   Rohan     4.3  32.00
7  Vishal     4.3  26.00
8   Rahul     4.1  27.40
9   Kumar     4.0  27.50

##### Creating and populating the fourth table named "ORDERS4" which contains the details of the orders given by a customer on Zomato fro different Restaurants associated with it in a week (1st Sept, 2019 to 7th Sept, 2019)
It has 4 columns :\
**ID** - Unique ID associated with each Order & also the primary key of the table\
**Date** - Date of the order\
**Customer_ID** - Id of the customer placing the order & also the Foreign Key as the Ids are similar to the Ids of the Customers in the CUSTOMER1 table \
**RESTAURANT_ID** - Id of the restaurant in which the order is placed & also the Foreign Key as the Ids are similar to the Ids of the Restaurants in the RESTAURANTS1 table

In [192]:
cursor.execute('''CREATE TABLE ORDERS4
         (ID INT PRIMARY KEY     NOT NULL,
         DATE        DATETIME,
         CUSTOMER_ID INT references CUSTOMER1(ID),
         RESTAURANT_ID INT references RESTAURANTS1(ID));''')

In [198]:
cursor.execute("INSERT INTO ORDERS4 (ID,DATE,CUSTOMER_ID,RESTAURANT_ID)\
       VALUES (130, '2019-09-03', 25, 117)");
cursor.execute("INSERT INTO ORDERS4 (ID,DATE,CUSTOMER_ID,RESTAURANT_ID)\
       VALUES (131, '2019-09-07', 27, 123)");
cursor.execute("INSERT INTO ORDERS4 (ID,DATE,CUSTOMER_ID,RESTAURANT_ID)\
       VALUES (132, '2019-09-01', 25, 117)");
cursor.execute("INSERT INTO ORDERS4 (ID,DATE,CUSTOMER_ID,RESTAURANT_ID)\
       VALUES (133, '2019-09-06', 39, 109)");
cursor.execute("INSERT INTO ORDERS4 (ID,DATE,CUSTOMER_ID,RESTAURANT_ID)\
       VALUES (134, '2019-09-05', 33, 109)");
cursor.execute("INSERT INTO ORDERS4 (ID,DATE,CUSTOMER_ID,RESTAURANT_ID)\
       VALUES (135, '2019-09-02', 25, 117)");
cursor.execute("INSERT INTO ORDERS4 (ID,DATE,CUSTOMER_ID,RESTAURANT_ID)\
       VALUES (136, '2019-09-04', 25, 117)");

conn.commit()

###  Table Containing details of orders put by users on zomato from different Restaurants in a week

In [203]:
Order_table

    ID        DATE  CUSTOMER_ID  RESTAURANT_ID
0  130  2019-09-03           25            117
1  131  2019-09-07           27            123
2  132  2019-09-01           25            117
3  133  2019-09-06           39            109
4  134  2019-09-05           33            109
5  135  2019-09-02           25            117
6  136  2019-09-04           25            117

My try to solve the test to the best of my knowledge. I thank the YULU team for giving me this opportunity. Will be looking forward to hear back from you.